export default [
    {
        id: 0,
        text: `江村暮 与 LOYI 为您呈现
            `,
        bgm: "/audioes/bgm2.m4a",
        action: [
            {
                to: 1,
                text: '📕新的故事'
            }
        ]
    }, {
        id: 1,
        text: `加油鸭很擅长做朱古力。

                让我们靠近她的那座朱古力做的小屋，

                我们可以看见： 

                她很细心的磨制可可粉；

                她很认真的提取可可脂；

                她很小心的控制面粉量；

                她的小花园里种满了可可树呢。

                哇唔，她做的朱古力美味极了！

                在她的朱古力日历上

                八月十八日的时间画上了红圈圈&小花瓣

                旁边写着“Duck YiMoDo's birthday”

                （鸭妹的生日）    

                明天就是鸭妹的生日了，加油鸭加油呀。
                 
                加油鸭做了许多朱古力，   

                彩色糖粒的白巧克力   

                马卡龙型的黑巧克力   

                焦糖包裹的苦巧克力    
                …
                糟糕的是，加油鸭发现没有多余的面粉去做巧克力蛋糕了。

                我们应当怎样帮助加油鸭呢？
            `,
        action: [
            {
                to: 2,
                text: '🥚把左手的袋装面粉送给加油鸭'
            }, {
                to: 3,
                text: '🍰把右手的盒装蛋糕送给加油鸭'
            }
        ]
    }, {
        id: 2,
        text: `加油鸭非常感谢你并且送给你了一些朱古力。

                三个小时后，加油鸭完成了巧克力蛋糕。 

                哇喔。真漂亮的巧克力蛋糕！     

                胚糕是塔形，朱古力与整个胚糕有机结合   

                渐变的黑褐色如丝带似的有层次的呈现螺旋卷  

                不同种类朱古力渗透着不同的位置        

                要是真的品尝起来每一口都是独一无二的   
                            
                加油鸭把巧克力蛋糕放入       

                大号的粉红色储餐箱里。    
                                
                现在加油鸭的硬巧克力小门打开了`,
        image: null,
        action: [
            {
                to: 3,
                text: '🥚左边的小路摆上了不少 嘎嘎单车'
            }, {
                to: 3,
                text: '🍰右边的车道上有一辆 咕咕计程车'
            }
        ]
    }, {
        id: 4,
        text: `加油鸭请出了自己的 蚂蚁先生，

            加油鸭的 蚂蚁先生 扫描了脚踏车编号。

            好了！现在 扫蚂成功 啦！        

            加油鸭仔细的固定好粉红色储餐盒   

            骑上脚踏车向 嘎嘎乡 出发。      

            …        

            唔…因为加油鸭使用的是脚踏车，

            很幸运的避开了 郁金香公路 上的堵车。        
            …       

            艾林萌麦田 布满金黄硕蕾     

            兔仔和猪小弟要侧着身才可以到达公路边缘。  

            咿呀，小心呢！加油鸭及时的刹车， 

            在兔仔与猪小弟 前方及时的停下 

            粉红色储餐盒小小的的晃动，    
               
            巧克力蛋糕没有受到碰撞很安全。
            
            你好呀，加油鸭！你去哪里呢？
            
            我要去 嘎嘎乡，欸………你们知道怎么走吗？
            
            过了 翠叶河 就可以看到了
            
             好！谢谢你们。欸…对了…你们是……
            
            我是猪小弟。
            
            我是兔仔。
            
            …
            
            在这个 艾林萌伐木累 里 
            
            加油鸭 的短时间记忆 只有 加油鸭 自己不知道的
            
            大家都以这样的方式帮助 加油鸭。
            
            加油呀！加油鸭。
            
            奇怪的是大量的朱古力制作方法
            
            加油鸭 记的十分清晰呢。
            
            …
            
            加油鸭 送给 猪小弟 与 兔仔 了一些朱古力
            
            向他们提示的方向，继续骑行。
             
            翻过 麦丘 进入眼帘的是 翠叶河
             
            湖水像极了薄荷色透明布丁，水流极慢。
             
            在湖内偶尔可以看见 嘎嘎乡 的鸭们
            
            感谢 嘎嘎单车 一路的陪伴，
            
            加油鸭 锁上了 嘎嘎单车 。
            
            好了，现在 加油鸭 准备渡河了`,
        image: null,
        action: [
            {
                to: 4,
                text: '渡河时 加油鸭 的指向与河岸垂直'
            }, {
                to: 3,
                text: '渡河时 加油鸭 的指向与河岸垂直'
            }
        ]
    }, {
        id: 4,
        text: `
            加油鸭遇见了 嘎嘎乡 的鸭们

            嘎。你们好呀！（方言）

            嘎。你好！

            嘎。你就是 加油鸭 吗？！

            嘎。做的朱古力超好吃的那个！！

            加油鸭 谦虚的交流着

            嘎。你们知道我们家的 鸭妹 现在住哪里吗？

            嘎？鸭妹？

            嘎？你们家的鸭妹？

            嘎。你的母亲只有你一个女儿。

            加油鸭 惊讶极了。

            反复的确认着朱古力日历上的标记

            没错的，上面确实是在八月十八日的时间

            写着“Duck YiMoDo's birthday”

            （鸭妹的生日）

            嘎。你去问问你的鸭哥 舟嘿鸭。

            嘎。他就住在 百草街

            实在是糟糕，

            加油鸭 完全不记得自己的兄长

            …

            加油鸭？！你怎么….你怎么自己回来了？！

            我们可以看见他的喜悦与担忧

            舟嘿鸭 放下手中的面粉团

            加油鸭 放下餐盒，

            加油鸭 把 朱古力日历 拿了出来递给 舟嘿鸭

            舟嘿鸭 接过日历

            这个日历………是我的……

            …

            …

            加油鸭 可以记忆所有 朱古力 的做法
            
            却无法记忆自己的所有亲友

            但那有何妨呢？

            至少

            加油鸭 知道

            自己做的 朱古力 是送给所有 艾琳萌

            送给被遗忘的那个亲爱的家伙。

            …


            生日快乐！加油鸭！

            加油鸭～生日快乐。

            生日快乐喲。

            生日快乐！

            生日快乐呐！

            生辰快乐。

            生日快乐。加油鸭。

            生日快乐。



            (完)

            `
    }
]
