export default {
	"0": {
		text:
			"江村暮 与 LOYI 为您呈现\n\n\n        按住文字可以暂停\n            ",
		bgm: "/audioes/bgm1.m4a",
		action: [{ to: 1, text: "📕新的故事" }],
	},
	"1": {
		text:
			"加油鸭很擅长做朱古力。\n\n                让我们靠近她的那座朱古力做的小屋，\n\n                我们可以看见： \n\n                她很细心的磨制可可粉；\n\n                她很认真的提取可可脂；\n\n                她很小心的控制面粉量；\n\n                她的小花园里种满了可可树呢。\n\n                哇唔，她做的朱古力美味极了！\n\n                在她的🗓朱古力日历上\n\n                九月八日的时间画上了红圈圈&小花瓣\n\n                旁边写着“Duck YiMoDo's birthday”\n\n                （鸭妹的生日）    \n\n                明天就是鸭妹的生日了，加油鸭加油呀。\n                 \n                加油鸭做了许多朱古力，   \n\n                🍩彩色糖粒的白巧克力   \n\n                🎂马卡龙型的黑巧克力   \n\n                🍮焦糖包裹的苦巧克力    \n                …\n                糟糕的是，加油鸭发现没有多余的面粉去做巧克力蛋糕了。\n\n                我们应当怎样帮助加油鸭呢？\n            ",
		action: [
			{ to: "flour", text: "🍚把左手的袋装面粉送给加油鸭" },
			{ to: "cake", text: "🍰把右手的盒装蛋糕送给加油鸭" },
		],
	},
	flour: {
		text:
			"加油鸭非常感谢你并且送给你了一些朱古力。\n\n                三个小时后，加油鸭完成了巧克力蛋糕。 \n\n                哇喔。真漂亮的巧克力蛋糕！     \n\n                胚糕是塔形，朱古力与整个胚糕有机结合   \n\n                渐变的黑褐色如丝带似的有层次的呈现螺旋卷  \n\n                不同种类朱古力渗透着不同的位置        \n\n                要是真的品尝起来每一口都是独一无二的   \n                            \n                加油鸭把巧克力蛋糕放入       \n\n                大号的粉红色储餐箱里。    \n                                \n                现在加油鸭的硬巧克力小门打开了",
		action: [
			{ to: "gaga", text: "🚲左边的小路摆上了不少 嘎嘎单车" },
			{ to: "gugu", text: "🚕右边的车道上有一辆 咕咕计程车" },
		],
	},
	gaga: {
		bgm: "/audioes/bgm3.mp3",
		text:
			"加油鸭请出了自己的 蚂蚁先生，\n\n            加油鸭的 蚂蚁先生 扫描了脚踏车编号。\n\n            好了！现在 扫蚂成功 啦！        \n\n            加油鸭仔细的固定好粉红色储餐盒   \n\n            骑上脚踏车向 嘎嘎乡 出发。      \n\n            …        \n\n            唔…因为加油鸭使用的是脚踏车，\n\n            很幸运的避开了 郁金香公路 上的堵车。        \n            …       \n\n            艾林萌麦田 布满金黄硕蕾     \n\n            兔仔和猪小弟要侧着身才可以到达公路边缘。  \n\n            咿呀，小心呢！加油鸭及时的刹车， \n\n            在兔仔与猪小弟 前方及时的停下 \n\n            粉红色储餐盒小小的的晃动，    \n               \n            巧克力蛋糕没有受到碰撞很安全。\n            \n            你好呀，加油鸭！你去哪里呢？\n            \n            我要去 嘎嘎乡，欸………你们知道怎么走吗？\n            \n            过了 翠叶河 就可以看到了\n            \n             好！谢谢你们。欸…对了…你们是……\n            \n            我是猪小弟。\n            \n            我是兔仔。\n            \n            …\n            \n            在这个 艾林萌伐木累 里 \n            \n            加油鸭 的短时间记忆 只有 加油鸭 自己不知道的\n            \n            大家都以这样的方式帮助 加油鸭。\n            \n            加油呀！加油鸭。\n            \n            奇怪的是大量的朱古力制作方法\n            \n            加油鸭 记的十分清晰呢。\n            \n            …\n            \n            加油鸭 送给 猪小弟 与 兔仔 了一些朱古力\n            \n            向他们提示的方向，继续骑行。\n             \n            翻过 麦丘 进入眼帘的是 翠叶河\n             \n            湖水像极了薄荷色透明布丁，水流极慢。\n             \n            在湖内偶尔可以看见 嘎嘎乡 的鸭们\n            \n            感谢 嘎嘎单车 一路的陪伴，\n            \n            加油鸭 锁上了 嘎嘎单车 。\n            \n            好了，现在 加油鸭 准备渡河了",
		action: [
			{ to: "horizal", text: "渡河时 加油鸭 的指向与河岸垂直" },
			{ to: "45d", text: "渡河时 加油鸭 的指向与河岸呈45度 " },
		],
	},
	horizal: {
		text:
			"\n            加油鸭遇见了 嘎嘎乡 的鸭们\n\n            加油鸭说起了亲切的家乡话。\n\n            嘎。里mun吼阿！\n\n            嘎。里吼！\n\n            嘎。里ziu四 嘎油鸭 吗？！\n\n            嘎。zue的朱go力tiao吼吃的low个！！\n\n            加油鸭 谦虚的交流着\n\n            嘎。里mun再斗ngua们家的 a妹 hian在组哪里嘛？\n\n            嘎？阿妹？\n\n            嘎？里们嘎的鸭妹？\n\n            嘎。里的母cing只有你一够女林。\n\n            加油鸭 惊讶极了。\n\n            反复的确认着🗓朱古力日历上的标记\n\n            没错的，上面确实是在九月八日的时间\n\n            写着“Duck YiMoDo's birthday”\n\n            （鸭妹的生日）\n\n            嘎。你去问问你的鸭哥 舟嘿鸭。\n\n            嘎。他就住在 百草街\n\n            实在是糟糕，\n\n            加油鸭 完全不记得自己的兄长\n\n            …\n\n            嘎油啊？！里怎么….里怎么自gi辉来了？！\n\n            我们可以看见他的喜悦与担忧\n\n            舟嘿鸭 放下手中的面粉团\n\n            加油鸭 放下餐盒，\n\n            加油鸭 把 朱古力日历 拿了出来递给 舟嘿鸭\n\n            舟嘿鸭 接过日历\n\n            这够日历………是我的……\n\n            …\n\n            …\n\n            加油鸭 可以记忆所有 朱古力 的做法\n            \n            却无法记忆自己的所有亲友\n\n            但那有何妨呢？\n\n            至少\n\n            加油鸭 知道\n\n            自己做的 朱古力 是送给所有 艾琳萌\n\n            送给被遗忘的那个亲爱的家伙。\n\n            …\n\n\n            生日快乐！加油鸭！\n\n            加油鸭～生日快乐。\n\n            生日快乐喲。\n\n            si lit kui ngak！\n\n            生日快乐呐！\n\n            生辰快乐。\n\n            ❤生日快乐。加油鸭。\n\n            生日快乐。\n\n            ",
		action: [{ to: 0, text: "从新开始" }],
	},
	"45d": {
		text:
			"加油鸭  浮游时没有遇见 其他的鸭们\n\n\n        绿色充实着 翠叶河\n        \n        \n        正菱形的 洛怀桑 线条优美\n        \n        \n        涓流拂过的石有光滑痕迹\n        \n        \n        间竹 指示着四面方向\n        \n        \n        远空的云慢的出奇\n        \n        \n        加油鸭 在这条安静的 翠叶河 里\n        \n        \n        迷失了去向。\n        \n        \n        …\n        \n        \n        加油鸭！ \n        \n        在岸边，有鸭在唤着这个名字。\n        \n        \n        加油鸭！是你吗？！\n        \n        那鸭又一次唤着这个名字\n        \n        \n        加油鸭 回归了思考\n        \n        向着 \n        那鸭的岸游去\n        \n        当然\n        \n        \n        加油鸭 不记得这鸭的名字\n        \n        但这鸭一定认识 加油鸭 的\n        \n        \n        加油鸭想知道这鸭是谁\n        \n        你是谁…\n        \n        \n        \n        那鸭没有回答 加油鸭 的问题\n        \n        \n        生日快乐，加油鸭。\n        \n        …\n        今天…是鸭妹的生日…不是我的……\n        \n        说着，加油鸭拿出 🗓朱古力日历\n        \n        上面的确写着：\n        九月八日的时间\n        “Duck YiMoDo's birthday”\n        （鸭妹的生日）\n        \n         … \n        \n        你就是鸭妹\n        \n        \n        我只有你一个妹妹\n        \n        …\n        \n        加油鸭 可以记忆所有 朱古力 的做法\n         \n        \n        却无法记忆自己的所有亲友\n        \n        但那有何妨呢？\n        \n        \n        至少\n        \n         加油鸭 知道\n        \n        自己做的 朱古力 是送给所有 艾琳萌\n        \n        \n        送给被遗忘的那个亲爱的家伙。",
		action: [{ text: "从新开始", to: "0" }],
	},
	gugu: {
		bgm: "/audioes/bgm3.mp3",
		image: {
			src: "https://i.loli.net/2020/09/06/x6a81HjLvI7tsPw.png",
			point: 2
		},
		text:
			"右边的车道上有一辆 咕咕计程车\n\n\n        这辆计程车不知道在这里停留了多长时间\n        \n        \n        每一次 加油鸭 外出\n        \n        \n        都可以看见这辆计程车\n        \n        \n        计程车里的司机是 逮虾狐\n        \n        \n        他的脑袋上总有一只会叫的小龙虾\n        \n        \n        加油鸭很小心的坐在了后座\n        \n        \n        似乎她对这辆车十分陌生\n        \n        \n        你好，先生。\n        \n        我叫 逮虾狐\n        \n        好…好的，逮虾狐先生…我要去嘎嘎乡\n        \n        \n        加油鸭手中捏着 朱古力便利贴\n        \n        \n        妳需要支付 二十贝贝\n        \n        要知道嘎嘎乡和\n        加油鸭的朱古力小屋\n        距离120公里\n        \n         咕咕计程车 3公里1贝贝\n        120公里应当是\n        40贝贝\n         \n        逮虾狐 可不是会计算错误的 艾琳萌\n        \n        加油鸭 不会计算\n        \n        发动机打开后车速十分平稳\n        \n        \n        因为是计程车很快就靠近了\n        \n         郁金香公路\n        \n        …\n        \n        啊，糟糕了。\n        \n        \n        加油🚐鸭 遇上🚑了 郁金🚚香公路 🚛上的堵车",
		action: [
			{ text: "🤤静静的等待", to: "gugu-wait" },
			{ text: "🖐询问 计程车司机", to: "ask" },
		],
	},
	ask: {
		text:
			"司机先生…请问…\n\n        我叫 逮虾狐\n        \n        …逮虾狐先生 请问现在有什么办法\n        可以脱离这里的拥堵呢\n        \n        \n        当然是有的…不过你需要额外的支付\n        \n        那…需要多少贝贝呢…\n        \n        不…不，不是贝贝，\n        是只有妳才能支付的\n        \n        \n        这位司机的表情变得奇怪了起来\n        小龙虾像帽子一样遮住了他的眼睛\n        \n        那…我需要支付的是什么呢…\n        加油鸭 的语气紧张起来\n        \n        \n        一块白巧克力\n        \n        …\n        \n        逮虾狐 打开了车载音响\n        播放着理所应当的曲目\n        \n        小龙虾 压的很低\n        看不见 逮虾狐 的表情\n        \n        这辆似乎普通的 咕咕计程车\n        后桥盖 像收纳雨棚一样展开\n        是类似鸟翼般的机械翅膀\n        \n        呜啊啊！\n        加油鸭发出惊吓的叫声\n        \n        请安静一点。马上就要启动了。\n        \n        计程车 借助前面轿车上盖而滑行\n        \n        加油鸭感觉到 \n        \n        计程车 逐步远离地面\n        \n        很抱歉…\n        加油鸭 重新坐回了后座\n        \n        逮虾狐 专注于驾驶\n        \n        \n        再一次接触地面时\n        \n        到达了 嘎嘎乡\n        \n        \n        已经到了吗…\n        \n        是的，已经到了。\n        \n        好，谢谢。\n        加油鸭准备下车\n        \n        你知道吗，加油鸭。\n        \n        ？\n        \n        今天是妳的生日。\n        ",
	},
	"gugu-ask": {
		text:
			"时间慢了下来\n\n\n        加油鸭 在 咕咕计程车 里睡着了\n        \n        \n        当她醒来时 \n        \n        云们着装着深橘\n        \n        计程车行驶的十分平稳\n        \n        加油鸭甚至感觉不到\n        \n        计程车的移动\n        \n        \n        加油鸭拿出 朱古力便利贴\n        \n        看了看大号的粉红色餐盒\n        \n        此时的加油鸭什么也不记得\n        \n        …\n        \n        在这个 艾林萌伐木累 里 \n        \n        \n        加油鸭 的短时间记忆 只有 加油鸭 自己不知道的\n        \n        \n        奇怪的是大量的朱古力制作方法\n        \n        加油鸭 记的十分清晰呢。\n        …\n        \n        根据 朱古力便利贴 的提示\n        \n        加油鸭 知道了自己应当去 嘎嘎乡\n        \n        \n        因为 加油鸭 乘坐的是计程车\n        \n        \n        所以不用担心路线问题的\n        \n        …\n        \n        \n        已经到站了，加油鸭。\n        \n        ？司机先生…你认识我吗…\n        \n        我是 逮虾狐\n        \n        啊…好的，逮虾狐先生\n        \n        …没错，我不仅认识你…而且对你很了解\n        比如说…今天是你的生日\n        \n        是…是这样的吗…\n        \n        那是别人送你的礼物吗\n        \n        \n        逮虾狐 指着餐盒\n        \n        里面似乎是我做的朱古力蛋糕\n        \n        看起来很美味呢 …\n        \n        啊啊啊！逮虾狐先生 你在做什么呢！\n        \n        \n        逮虾狐 吃掉了蛋糕最上面的 朱古力珍珠蛋\n        \n        \n        啊…不好意思\n        话说你现在还能记住我的名字呢\n        \n        ？\n        \n        好了时间宝贵，吃蛋糕前先要许愿吧\n        \n        逮虾狐 从收纳箱里取出多色蜡烛\n        按照 加油鸭 的年龄\n        插上了对应数量的蜡烛\n        \n        嘎嘎乡 安静十分\n        唯一的光源在 计程车 里烁动\n        \n        …\n        \n        生日快乐。",
	},
	cake: {
		bgm: "/audioes/bgm2.m4a",
		text:
			"加油鸭 对于你送的盒装蛋糕很惊讶\n\n        加油鸭 送给你了一些朱古力表示感谢。\n        \n        呈比例的圆柱糕体\n        \n        \n        奶油油过于均匀\n        \n        \n        果片对称的拼接摆放\n        \n        \n        加油鸭 简洁的融入自己的朱古力\n        \n        \n        完成了对称而整齐的巧克力蛋糕\n        \n        \n        因为材料的多量\n        \n        味道一定是厚重的\n        \n        …\n        \n        加油鸭 重新包装蛋糕\n        \n        \n        带上了不同种类的朱古力\n        \n        \n        打开了 硬巧克力小门\n        \n        \n        …\n        \n        \n        \n        🚌公共巴士 作为了加油鸭的最终选择\n        \n        巴士的 艾琳萌 并不多\n        \n        加油鸭很快找到了座位\n        \n        …\n        唔…因为加油鸭选择的是 公共巴士\n        \n        \n        很幸运的避开了 郁金香公路 上的堵车\n        \n        …\n        \n        加油鸭 在终点站 晨華区 下了车\n        \n        …\n        \n        在 晨華区 一部分是 花圃 \n        \n        另一部分是 碧之森\n        \n        两边都有通向 嘎嘎乡 的路",
		action: [
			{ to: "garden", text: "🌼悠然的花圃" },
			{ to: "road", text: "🌳高木🌳碧之森🌳🌲🌲" },
		],
	},
	garden: {
		text:
			"悠然的花圃 像被🌷四季之花填充\n\n        🌷\n        当然有一些空余地\n        \n        没有到合适的季节\n        花们是不愿绽放的\n        \n        加油鸭 很喜欢花们\n        \n        虽然她说不出花们的名字\n        \n        \n        呜唔呜唔唔……\n        \n        在花圃那边有 艾琳萌 的抽泣声\n        \n        \n        加油鸭 任由好奇带路\n        \n        \n        在花圃那边空地的是 阿猬\n        她身上每一根刺上都有一块棉花糖\n        因为阿猬 很喜爱棉花糖\n        \n        阿猬 看见 加油鸭 后哭的更加厉害了。\n        \n        你…怎么了呢…\n        为什么要在这里哭泣呢\n        \n        加油鸭 很小心的询问\n        \n        呜唔呜…对不起…加油鸭……\n        \n        对方突然的道歉让 加油鸭 很惊讶\n        \n        我…把…送给你的生日蛋糕…弄丢了\n        连着盒子一起找不到了\n        \n        加油鸭看了看屏幕前的你\n        \n        …\n        \n        好了…好了，不要哭了啦…\n        说不定…已经送到了呐\n        \n        说着 加油鸭 将 包装蛋糕举高了一点\n        \n        \n        今天原来是我的生日呐\n        \n        …\n        \n        在这个 艾林萌伐木累 里 \n        \n        \n        加油鸭 的短时间记忆 \n        只有 加油鸭 自己不知道的\n         \n        奇怪的是大量的朱古力制作方法\n        \n        加油鸭 记的十分清晰呢。\n        \n        …\n        \n        \n        现在加油鸭有了同行的伙伴\n        \n        很多事件可以得到提示\n        \n        \n        薰衣草地 的尽头只有一条通道\n        \n        \n        这里通向 嘎嘎乡 喲～\n        \n        终于到了吗…\n         \n        \n        加油鸭 和 阿猬 道别了 薰衣草们\n        \n        \n        我猜呢，加油鸭…\n        \n        嗯？\n        \n        那个 🗓朱古力日历 是你老哥的啦。\n        \n        唔…很可能哟…\n        \n        总而言之呐，加油鸭…\n        今晚一定很让他惊喜呢\n        他一定猜不到你会来找他的\n        \n        两个 艾琳萌 讨论着如何庆祝生日\n        \n        愉快的风 拂过\n        所有生辰的幸运儿们",
		action: [{ to: "0", text: "新的故事" }],
	},
	road: {
		text:
			"高木碧之森 隐匿生物的信息\n\n        只要愿意涉足 一切将暴露\n        \n        \n        在黑暗中踟蹰的生灵\n        \n        在阳光里舞动的巧宠\n        \n        空气过于原始而屏住呼吸\n        \n        液体过于纯净而被基体排斥\n        \n        \n        加油鸭选择了这条未知的路途\n        \n        为了将朱古力送达生辰者身旁\n        \n        可惜的是 加油鸭 最终迷失了方向",
		action: [
			{ text: "🚶‍♂️四处走动", to: "walk" },
			{ text: "🦆呆在原地", to: "stay" },
		],
	},
	walk: {
		text:
			"加油鸭 发现前面有一位 🐻棕熊快递 的快递员\n\n\n        快递员 弯着腰似乎在寻找着什么\n        \n        你好，我可以帮到你什么呢。\n        \n        啊阿…ngua的面魂早不告了… 袋装面魂\n        …muamua上班前还在的啊…咋回事儿…\n        \n        \n        加油鸭了解后看了看屏幕前的你\n        \n        \n        不好意思…民魂跨能已经不在这里了\n        \n        那可怎么办……\n        \n        棕熊十分悲伤 每一根毛都在苦恼\n        \n        加油鸭 用 朱古力 来安抚\n        \n        这个失去面粉的家伙\n        \n        不过他面粉的去向\n        \n        加油鸭 的确已经知道了\n        \n        \n        我原本想做一点 甘梅饼干 的\n        \n        以后不把面粉放林子了\n        \n        …\n        \n        剩下的旅程有 棕熊快递员 同路\n        \n        \n        那些有害的怪家伙们都不敢出来了\n        \n        \n        …\n        \n        嘎。请Moon ngua们ga的a妹 \n        hian在4住哪里呢…\n        \n        嘎。？\n        嘎……里们ga只有你一个 阿妹 呀，\n        加油鸭 。\n\n        四…四这宗e吗…\n        …\n        … \n        si lit kui ngak！嘎油阿！\n        \n        加油鸭！生日快乐。\n        \n        ❤生日快乐唷～\n        \n        生日快乐。\n        \n        几乎所有的 艾琳萌 都到来\n        \n        为 加油鸭 庆贺她的生辰\n        ",
		action: [{ text: "从新开始", to: "0" }],
	},
	stay: {
		text:
			"加油鸭 在芳草气息中入睡\n\n\n        当她再一次睁开眼睛\n        \n        发现自己躺在床上\n        \n        一切就像没有发生过一样\n        \n        她顶着蓬乱的头向客厅走去\n        \n        踏进客厅的瞬间\n        彩带与喇叭声同时出现\n        \n        生日快乐！加油鸭！\n        \n        加油鸭！生日快乐。\n        \n        生日快乐！\n        \n        生日快乐唷～\n        \n        si lit kui ngak。\n        \n        几乎所有的 艾琳萌 都到来\n        \n        为 加油鸭 庆祝她的生日",
		action: [{ text: "从新开始", to: "0" }],
	},
	"gugu-wait": {
		text:
			"时间慢了下来\n\n\n        加油鸭 在 咕咕计程车 里睡着了\n        \n        \n        当她醒来时 \n        \n        云们着装着深橘\n        \n        计程车行驶的十分平稳\n        \n        加油鸭甚至感觉不到\n        \n        计程车的移动\n        \n        \n        加油鸭拿出 朱古力便利贴\n        \n        看了看大号的粉红色餐盒\n        \n        此时的加油鸭什么也不记得\n        \n        …\n        \n        在这个 艾林萌伐木累 里 \n        \n        \n        加油鸭 的短时间记忆 只有 加油鸭 自己不知道的\n        \n        \n        奇怪的是大量的朱古力制作方法\n        \n        加油鸭 记的十分清晰呢。\n        …\n        \n        根据 朱古力便利贴 的提示\n        \n        加油鸭 知道了自己应当去 嘎嘎乡\n        \n        \n        因为 加油鸭 乘坐的是计程车\n        \n        \n        所以不用担心路线问题的\n        \n        …\n        \n        \n        已经到站了，加油鸭。\n        \n        ？司机先生…你认识我吗…\n        \n        我是 逮虾狐\n        \n        啊…好的，逮虾狐先生\n        \n        …没错，我不仅认识你…而且对你很了解\n        比如说…今天是你的生日\n        \n        是…是这样的吗…\n        \n        那是别人送你的礼物吗\n        \n        \n        逮虾狐 指着餐盒\n        \n        里面似乎是我做的朱古力蛋糕\n        \n        看起来很美味呢 …\n        \n        啊啊啊！逮虾狐先生 你在做什么呢！\n        \n        \n        逮虾狐 吃掉了蛋糕最上面的 朱古力珍珠蛋\n        \n        \n        啊…不好意思\n        话说你现在还能记住我的名字呢\n        \n        ？\n        \n        好了时间宝贵，吃蛋糕前先要许愿吧\n        \n        逮虾狐 从收纳箱里取出多色蜡烛\n        按照 加油鸭 的年龄\n        插上了对应数量的蜡烛\n        \n        嘎嘎乡 安静十分\n        唯一的光源在 计程车 里烁动\n        \n        …\n        \n        生日快乐。",
		action: [{ text: "从新开始", to: "0" }],
	},
};
